def samai_predict(b_count, r_count, total_game, machine_type):
    #BIG獲得、REG獲得、コイン持ち
    machine_data = {
        "マイジャグラーV": {"BIG": 240, "REG": 96, "コイン持ち": 42},
        "ハナハナホウオウ〜天翔〜-30": {"BIG": 240, "REG": 120, "コイン持ち": 36.5},
        "ハナハナホウオウ～天翔～-30": {"BIG": 240, "REG": 120, "コイン持ち": 36.5},
        "ハナハナホウオウ?天翔?-30": {"BIG": 240, "REG": 120, "コイン持ち": 36.5},
        "ゴーゴージャグラー3": {"BIG": 240, "REG": 96, "コイン持ち": 39.5},
        "ゴーゴージャグラー３": {"BIG": 240, "REG": 96, "コイン持ち": 39.5},
        "アイムジャグラーEX-TP": {"BIG": 252, "REG": 96, "コイン持ち": 40},
        "アイムジャグラーEX": {"BIG": 252, "REG": 96, "コイン持ち": 40},
        "SアイムジャグラーＥＸ": {"BIG": 252, "REG": 96, "コイン持ち": 40},
        "ネオアイムジャグラーEX": {"BIG": 252, "REG": 96, "コイン持ち": 40},
        "キングハナハナ-30": {"BIG": 260, "REG": 120, "コイン持ち": 39.9},
        "ドラゴンハナハナ～閃光～‐30": {"BIG": 252, "REG": 96, "コイン持ち": 39.9},
        "ドラゴンハナハナ〜閃光〜‐30": {"BIG": 252, "REG": 96, "コイン持ち": 39.9},
        "ドラゴンハナハナ?閃光?‐30": {"BIG": 252, "REG": 96, "コイン持ち": 39.9},
        "ジャグラーガールズ": {"BIG": 240, "REG": 96, "コイン持ち": 42},
        "ジャグラーガールズSS": {"BIG": 240, "REG": 96, "コイン持ち": 42},
        "ウルトラミラクルジャグラー": {"BIG": 240, "REG": 96, "コイン持ち": 42},
        "ミスタージャグラー": {"BIG": 240, "REG": 96, "コイン持ち": 41},
        "ファンキージャグラー2": {"BIG": 240, "REG": 96, "コイン持ち": 42},
        "ファンキージャグラー２ＫＴ": {"BIG": 240, "REG": 96, "コイン持ち": 42},
        "スマスロ北斗の拳": {"BIG": 110, "REG": 0, "コイン持ち": 34.7},
        "Lスマスロ北斗の拳": {"BIG": 110, "REG": 0, "コイン持ち": 34.7},
        "スマート沖スロ ニューキングハナハナV": {"BIG": 312, "REG": 130, "コイン持ち": 37},
    }
    # スマスロ北斗の拳の場合、ゲーム数を調整
    machine = machine_data.get(machine_type)
    if machine is None:
        return 0
    coin_holding = float(machine['コイン持ち'])

    if machine_type == "スマスロ北斗の拳" or "Lスマスロ北斗の拳":
        total_game = total_game - ((b_count - r_count) * 10)

    # 差枚数計算
    samai = (b_count * machine["BIG"] + r_count * machine["REG"]) - (50 * total_game / coin_holding)
    return samai
#print(samai_predict(53, 14, 5458, "スマスロ北斗の拳"))